In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('retail_data.csv')
df

,Customer_ID,Age,Annual_Income,City,Mixed_ID,Transaction_Date,Spending_Score
0,1000,39,NaN,New York,ID_0,2023-01-01,500
1,1001,33,87501.712418,NaN,10.0,2023-01-02,600
2,1002,41,NaN,New York,ID_2,01-03-2023 04:00,-150
3,1003,50,80614.377811,New York,30.0,2023-01-04,800
4,1004,32,42274.617116,New York,ID_4,01-05-2023 08:00,1000
...,...,...,...,...,...,...,...
195,1195,38,26324.549797,New York,1950.0,2023-07-31,3
196,1196,26,26251.311600,Tokyo,ID_196,2023-08-01,32
197,1197,36,NaN,Dubai,1970.0,2023-08-02,10
198,1198,35,88529.885880,New York,ID_198,08-03-2023 12:00,74
199,1199,23,63777.688860,London,1990.0,08-04-2023 14:00,83

In [6]:
df['Mixed_ID'] = pd.to_numeric(df['Mixed_ID'], errors = 'coerce')
df['Mixed_ID'].sample(10)

114       NaN
6         NaN
126       NaN
57      570.0
58        NaN
22        NaN
107    1070.0
21      210.0
172       NaN
69      690.0
Name: Mixed_ID, dtype: float64

In [9]:
df['Mixed_ID'].fillna(0, inplace=True)

In [11]:
df['cleaned_dates'] = pd.to_datetime(df['Transaction_Date'], errors = 'coerce')

In [14]:
df.sample(19)

,Customer_ID,Age,Annual_Income,City,Mixed_ID,Transaction_Date,Spending_Score,cleaned_dates,year
50,1050,38,110388.382106,Dubai,0.0,2023-02-24,2,2023-02-24,2023.0
110,1110,15,NaN,London,0.0,2023-04-30,73,2023-04-30,2023.0
172,1172,34,23777.304476,London,0.0,2023-07-06,29,2023-07-06,2023.0
36,1036,37,22653.254796,Paris,0.0,02-09-2023 00:00,31,NaT,NaN
93,1093,31,NaN,Dubai,930.0,11/04/2023,23,NaT,NaN
86,1086,44,54971.972630,Paris,0.0,04-04-2023 04:00,51,NaT,NaN
17,1017,38,40624.120357,Tokyo,170.0,01-19-2023 10:00,94,NaT,NaN
9,1009,40,142230.798092,Dubai,90.0,10/01/2023,7,NaT,NaN
121,1121,25,101349.790300,New York,1210.0,12/05/2023,90,NaT,NaN
82,1082,49,70405.726802,New York,0.0,30/03/2023,72,NaT,NaN
95,1095,20,62839.122279,London,950.0,04-13-2023 22:00,46,NaT,NaN
142,1142,18,NaN,New York,0.0,2023-06-03,49,2023-06-03,2023.0
65,1065,48,34233.064614,Tokyo,650.0,03-12-2023 10:00,23,NaT,NaN
185,1185,42,NaN,Paris,1850.0,07-20-2023 10:00,92,NaT,NaN
29,1029,32,NaN,NaN,290.0,02-01-2023 10:00,66,NaT,NaN
137,1137,31,136422.284043,New York,1370.0,2023-05-29,71,2023-05-29,2023.0
43,1043,31,NaN,NaN,430.0,2023-02-16,8,2023-02-16,2023.0
187,1187,34,60868.020378,NaN,1870.0,07-22-2023 14:00,38,NaT,NaN
148,1148,40,NaN,London,0.0,06-10-2023 08:00,85,NaT,NaN

In [13]:
df['year'] = df['cleaned_dates'].dt.year

In [21]:

from sklearn.preprocessing import LabelEncoder, OrdinalEncoder

ordenc =OrdinalEncoder()
df['City_Ordinal'] = ordenc.fit_transform(df[['City']].fillna('Unknown'))
df.head()

labenc = LabelEncoder()
df['City_Label'] = labenc.fit_transform(df[['City']].fillna("unknown"))


df_ohe = pd.get_dummies(df, columns= ['City'], prefix ="is" )
df_ohe

/Library/Frameworks/Python.framework/Versions/3.14/lib/python3.14/site-packages/sklearn/preprocessing/_label.py:120: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

,Customer_ID,Age,Annual_Income,Mixed_ID,Transaction_Date,Spending_Score,cleaned_dates,year,City_Ordinal,City_Label,is_Dubai,is_London,is_New York,is_Paris,is_Tokyo
0,1000,39,NaN,0.0,2023-01-01,500,2023-01-01,2023.0,2.0,2,False,False,True,False,False
1,1001,33,87501.712418,10.0,2023-01-02,600,2023-01-02,2023.0,5.0,5,False,False,False,False,False
2,1002,41,NaN,0.0,01-03-2023 04:00,-150,NaT,NaN,2.0,2,False,False,True,False,False
3,1003,50,80614.377811,30.0,2023-01-04,800,2023-01-04,2023.0,2.0,2,False,False,True,False,False
4,1004,32,42274.617116,0.0,01-05-2023 08:00,1000,NaT,NaN,2.0,2,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,1195,38,26324.549797,1950.0,2023-07-31,3,2023-07-31,2023.0,2.0,2,False,False,True,False,False
196,1196,26,26251.311600,0.0,2023-08-01,32,2023-08-01,2023.0,4.0,4,False,False,False,False,True
197,1197,36,NaN,1970.0,2023-08-02,10,2023-08-02,2023.0,0.0,0,True,False,False,False,False
198,1198,35,88529.885880,0.0,08-03-2023 12:00,74,NaT,NaN,2.0,2,False,False,True,False,False
199,1199,23,63777.688860,1990.0,08-04-2023 14:00,83,NaT,NaN,1.0,1,False,True,False,False,False